/*************    功能说明    **************
文 件 名：U51delay.c
功    能：软件延时
修改日期：2017-03-13
******************************************/

#include	"U51V2.h"


//========================================================================
// 函数: void  delay_ms(unsigned char ms)
// 描述: ms粗延时函数。
// 参数: ms,要延时的ms数, 只支持1~255ms. 
// 返回: none.
// 版本: VER1.0
// 日期: 2017-03-13
// 备注: 在U51V2.h中指定主时钟后，本函数自动适应.
//========================================================================
void  delay_ms(unsigned char ms)
{
     unsigned int i;
	 do{
	      i = MAIN_Fosc / 13000;
		  while(--i);   //14T per loop
     }while(--ms);
}
/*=================更新日志==================
日期：2017-03-13
	delay_ms(ms)
******************************************/